// Execution of BITSAdmin for File Download
// Note: This is an AI Generated Rule use with caution
// https://thedfirreport.com/2024/01/29/buzzing-on-christmas-eve-trigona-ransomware-in-3-hours/
// MITRE Tactic and Technique: T1197 - BITS Jobs
DeviceProcessEvents
| where FileName == "bitsadmin.exe" or InitiatingProcessFileName == "bitsadmin.exe"
| where CommandLine contains "/transfer" or CommandLine contains "/download" or CommandLine contains "/addfile"
| summarize DownloadAttempts=count(), UniqueMachines=dcount(DeviceId) by DeviceId, CommandLine
| where DownloadAttempts > 0 // BITSAdmin download attempts are suspicious, worth investigating each occurrence