// Credential Dumping via comsvcs.dll
// Note: This is an AI Generated Rule use with caution
// https://thedfirreport.com/2024/01/29/buzzing-on-christmas-eve-trigona-ransomware-in-3-hours/
// MITRE Tactic and Technique: T1003.001 - OS Credential Dumping: LSASS Memory
DeviceProcessEvents
| where InitiatingProcessFileName == "rundll32.exe" and CommandLine contains "comsvcs.dll"
| summarize DumpingAttempts=count(), UniqueMachines=dcount(DeviceId) by DeviceId, CommandLine
| where DumpingAttempts >0 // Capturing all instances as this activity is highly suspicious